1s/ERP/extensions/liko/AccumulationRegisters/ВыручкаИСебестоимостьПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВыручкаИСебестоимостьПродаж</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазделыУчетаСебестоимостиТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаУчетаПартий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельностиКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельностиНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаФинансовогоУчета</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаУчетаНаборов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНаборов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/КлючиАналитикиУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КлючиАналитикиУчетаНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоХранения</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/КлючиАналитикиУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КлючиАналитикиУчетаПоПартнерам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/РасчетСебестоимостиПостатейныеЗатраты/Ext/Module.bsl
&ИзменениеИКонтроль("ТекстЗапросаБазаРаспределенияРасходовНаЗаказы")
Функция Лико_ТекстЗапросаБазаРаспределенияРасходовНаЗаказы()

	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,  
	#Удаление
	|	Заказ.Ссылка КАК АналитикаРасходов,
	|	Заказ.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	Заказ.НаправлениеДеятельности КАК НаправлениеДеятельности,    
	#КонецУдаления
	#Вставка
	|	Лико_Заказ.Ссылка КАК АналитикаРасходов,
	|	Лико_Заказ.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	Лико_Заказ.НаправлениеДеятельности КАК НаправлениеДеятельности,    
	#КонецВставки
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Серия КАК Серия,
	|	ТоварыЗаказа.Склад КАК Склад,
	|	ТоварыЗаказа.КодСтроки КАК КодСтроки,
	|	ТоварыЗаказа.СтатусУказанияСерий В (14, 18) КАК СерияУказывается
	|ПОМЕСТИТЬ ВтОтборПоЗаказуКлиентаДетально
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ДД
	|                                         
	#Удаление
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказ     
	|	ПО Заказ.Ссылка = ДД.АналитикаРасходов
	#КонецУдаления
	#Вставка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Лико_Заказ 
	|	ПО Лико_Заказ.Ссылка = ДД.АналитикаРасходов
	#КонецВставки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
	|	ПО ТоварыЗаказа.Ссылка = ДД.АналитикаРасходов
	|
	// Исключаем заказы, которые учтены во временной таблице ВтОтборПродажПоЗаказу.
	// Расходы по таким заказам уже распределены. 
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтОтборПродажПоЗаказу КАК ВтОтборПродажПоЗаказу
	|	ПО ВтОтборПродажПоЗаказу.Организация = ДД.Организация
	|		И ВтОтборПродажПоЗаказу.АналитикаРасходов = ДД.АналитикаРасходов
	|		И ВтОтборПродажПоЗаказу.НаправлениеДеятельности = ДД.НаправлениеДеятельности
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ВтОтборПродажПоЗаказу.АналитикаРасходов ЕСТЬ NULL
	|
	//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ТоварыЗаказа.Ссылка КАК АналитикаРасходов,
	|	ЛОЖЬ КАК ВернутьМногооборотнуюТару,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Серия КАК Серия,
	|	ТоварыЗаказа.Склад КАК Склад,
	|	ТоварыЗаказа.КодСтроки КАК КодСтроки,
	|	ТоварыЗаказа.СтатусУказанияСерий В (14, 18) КАК СерияУказывается
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5.Продукция КАК ТоварыЗаказа
	|	ПО ТоварыЗаказа.Ссылка = ДД.АналитикаРасходов
	|
	// Исключаем заказы, которые учтены во временной таблице ВтОтборПродажПоЗаказу.
	// Расходы по таким заказам уже распределены. 
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтОтборПродажПоЗаказу КАК ВтОтборПродажПоЗаказу
	|	ПО ВтОтборПродажПоЗаказу.Организация = ДД.Организация
	|		И ВтОтборПродажПоЗаказу.АналитикаРасходов = ДД.АналитикаРасходов
	|		И ВтОтборПродажПоЗаказу.НаправлениеДеятельности = ДД.НаправлениеДеятельности
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ВтОтборПродажПоЗаказу.АналитикаРасходов ЕСТЬ NULL
	//-- НЕ УТКА
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтОтборПоЗаказуКлиентаДетально.Организация КАК Организация,
	|	ВтОтборПоЗаказуКлиентаДетально.АналитикаРасходов КАК АналитикаРасходов,
	|	ВтОтборПоЗаказуКлиентаДетально.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	ВтОтборПоЗаказуКлиентаДетально.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПоЗаказуКлиента
	|ИЗ
	|	ВтОтборПоЗаказуКлиентаДетально КАК ВтОтборПоЗаказуКлиентаДетально
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК КодИсточника,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.Распоряжение КАК ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.Номенклатура КАК Номенклатура,
	|	ДД.Характеристика КАК Характеристика,
	|	ДД.КодСтроки КАК КодСтроки,
	|	ДД.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ВтОтборПоЗаказуКлиента.СерияУказывается
	|		ТОГДА ДД.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход) КАК Факт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)
	|			ТОГДА -ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Приход)
	|			ТОГДА ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПлан,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)
	|			ТОГДА &Вес * -ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Приход)
	|			ТОГДА &Вес * ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесПлан,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)
	|			ТОГДА &Объем * -ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Приход)
	|			ТОГДА &Объем * ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПлан,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)
	|			ТОГДА -ДД.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Приход)
	|			ТОГДА ДД.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПлан,
	|	0 КАК КоличествоПродано,
	|	0 КАК СебестоимостьСНДС,
	|	0 КАК СебестоимостьБезНДС,
	|	0 КАК СебестоимостьРегл,
	|	0 КАК СебестоимостьУпр
	|
	|ПОМЕСТИТЬ ВтЗаказыПланФактИсходныеДанные
	|ИЗ
	|	РегистрНакопления.РаспоряженияНаОтгрузку КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПоЗаказуКлиентаДетально КАК ВтОтборПоЗаказуКлиента
	|		ПО ДД.Распоряжение = ВтОтборПоЗаказуКлиента.АналитикаРасходов
	|			И ДД.Распоряжение.Организация = ВтОтборПоЗаказуКлиента.Организация
	|			И ДД.Номенклатура = ВтОтборПоЗаказуКлиента.Номенклатура
	|			И ДД.Характеристика = ВтОтборПоЗаказуКлиента.Характеристика
	|			И ДД.Серия = ВтОтборПоЗаказуКлиента.Серия
	|			И ДД.Склад = ВтОтборПоЗаказуКлиента.Склад
	|			И ДД.КодСтроки = ВтОтборПоЗаказуКлиента.КодСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ДД.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период <= &КонецПериода
	|	И ДД.Заказано <> 0
	|	И НЕ (ВтОтборПоЗаказуКлиента.ВернутьМногооборотнуюТару И СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Себестоимость продаж прошлого периода.
	|ВЫБРАТЬ
	|	2 КАК КодИсточника,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	0 КАК КодСтроки,
	|	(ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ДД.Склад КОНЕЦ) КАК Склад,
	|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	ИСТИНА КАК Факт,
	|	0 КАК КоличествоФакт,
	|	0 КАК КоличествоПлан,
	|	0 КАК ВесФакт,
	|	0 КАК ВесПлан,
	|	0 КАК ОбъемФакт,
	|	0 КАК ОбъемПлан,
	|	0 КАК СуммаФакт,
	|	0 КАК СуммаПлан,
	|	СУММА(ДД.Количество) КАК КоличествоПродано,
	|	СУММА(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК СебестоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС
	|		+ ДД.ДопРасходыБезНДС
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеБезНДС
	|		+ ДД.ПостатейныеПеременныеБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл) КАК СебестоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ТрудозатратыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр) КАК СебестоимостьУпр
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПоЗаказуКлиента КАК ВтОтборПоЗаказуКлиента
	|	ПО ВтОтборПоЗаказуКлиента.АналитикаРасходов = ДД.ЗаказКлиента
	|		И ВтОтборПоЗаказуКлиента.Организация = ДД.АналитикаУчетаПоПартнерам.Организация
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период < &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
	|	(ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ДД.Склад КОНЕЦ), // Склад
	|	ДД.АналитикаУчетаНоменклатуры.Серия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Себестоимость продаж текущего периода.
	|ВЫБРАТЬ
	|	3 КАК КодИсточника,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	0 КАК КодСтроки,
	|	(ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ДД.Склад КОНЕЦ) КАК Склад,
	|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	ИСТИНА КАК Факт,
	|	0 КАК КоличествоФакт,
	|	0 КАК КоличествоПлан,
	|	0 КАК ВесФакт,
	|	0 КАК ВесПлан,
	|	0 КАК ОбъемФакт,
	|	0 КАК ОбъемПлан,
	|	0 КАК СуммаФакт,
	|	0 КАК СуммаПлан,
	|	СУММА(ДД.Количество) КАК КоличествоПродано,
	|	СУММА(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК СебестоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС
	|		+ ДД.ДопРасходыБезНДС
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеБезНДС
	|		+ ДД.ПостатейныеПеременныеБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл) КАК СебестоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ТрудозатратыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр) КАК СебестоимостьУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПоЗаказуКлиента КАК ВтОтборПоЗаказуКлиента
	|	ПО ВтОтборПоЗаказуКлиента.АналитикаРасходов = ДД.ЗаказКлиента
	|		И ВтОтборПоЗаказуКлиента.Организация = ДД.АналитикаУчетаПоПартнерам.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
	|	(ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ДД.Склад КОНЕЦ), // Склад
	|	ДД.АналитикаУчетаНоменклатуры.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.ЗаказКлиента				КАК ЗаказКлиента,
	|	ДД.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) > СУММА(ДД.КоличествоФакт) ТОГДА СУММА(ДД.КоличествоПродано)
	|		ИНАЧЕ СУММА(ДД.КоличествоФакт)
	|	КОНЕЦ)						КАК КоличествоФакт,
	|	СУММА(ДД.ВесФакт)			КАК ВесФакт,
	|	СУММА(ДД.ОбъемФакт)			КАК ОбъемФакт,
	|	СУММА(ДД.СуммаФакт)			КАК СуммаФакт,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) > СУММА(ДД.КоличествоФакт) ТОГДА СУММА(ДД.КоличествоПродано)
	|		ИНАЧЕ СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ)						КАК КоличествоПлан,
	|	СУММА(ДД.ВесПлан)			КАК ВесПлан,
	|	СУММА(ДД.ОбъемПлан)			КАК ОбъемПлан,
	|	ВЫБОР 
	|		КОГДА СУММА(ДД.СуммаФакт) > СУММА(ДД.СуммаПлан)
	|			ТОГДА СУММА(ДД.СуммаФакт)
	|		ИНАЧЕ СУММА(ДД.СуммаПлан)
	|	КОНЕЦ						КАК СуммаПлан,
	|	СУММА(ДД.СебестоимостьСНДС)	КАК СебестоимостьСНДС,
	|	СУММА(ДД.СебестоимостьБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СебестоимостьРегл)	КАК СебестоимостьРегл,
	|	СУММА(ДД.СебестоимостьУпр)	КАК СебестоимостьУпр,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьСНДС)
	// При наличии возвратов (продано меньше факта) используем данные себестоимости без пересчета.
	|		КОГДА СУММА(ДД.КоличествоФакт) > СУММА(ДД.КоличествоПродано)
	|			ТОГДА СУММА(ДД.СебестоимостьСНДС)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьСНДС)
	|		ИНАЧЕ (СУММА(ДД.СебестоимостьСНДС) / СУММА(ДД.КоличествоПродано)) * СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ) КАК СебестоимостьСНДСПлан,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьБезНДС)
	|		КОГДА СУММА(ДД.КоличествоФакт) > СУММА(ДД.КоличествоПродано)
	|			ТОГДА СУММА(ДД.СебестоимостьБезНДС)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьБезНДС)
	|		ИНАЧЕ (СУММА(ДД.СебестоимостьБезНДС) / СУММА(ДД.КоличествоПродано)) * СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ) КАК СебестоимостьБезНДСПлан,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьРегл)
	|		КОГДА СУММА(ДД.КоличествоФакт) > СУММА(ДД.КоличествоПродано)
	|			ТОГДА СУММА(ДД.СебестоимостьРегл)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьРегл)
	|		ИНАЧЕ СУММА(ДД.СебестоимостьРегл) / СУММА(ДД.КоличествоПродано) * СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ) КАК СебестоимостьРеглПлан,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьУпр)
	|		КОГДА СУММА(ДД.КоличествоФакт) > СУММА(ДД.КоличествоПродано)
	|			ТОГДА СУММА(ДД.СебестоимостьУпр)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьУпр)
	|		ИНАЧЕ СУММА(ДД.СебестоимостьУпр) / СУММА(ДД.КоличествоПродано) * СУММА(ДД.КоличествоПлан)
	|	 КОНЕЦ) КАК СебестоимостьУпрПлан
	|
	|ПОМЕСТИТЬ ВтПланФактПоЗаказу
	|ИЗ
	|	ВтЗаказыПланФактИсходныеДанные КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.ЗаказКлиента,
	|	ДД.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ДД.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ДД.Номенклатура КАК Номенклатура,
	|	ДД.Характеристика КАК Характеристика,
	|	ДД.Склад КАК Склад,
	|	ДД.Серия КАК Серия,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) > СУММА(ДД.КоличествоФакт) ТОГДА СУММА(ДД.КоличествоПродано)
	|		ИНАЧЕ СУММА(ДД.КоличествоФакт)
	|	КОНЕЦ) КАК Количество,
	|	СУММА(ДД.СуммаФакт) КАК Сумма,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.КоличествоПлан) = 0 ТОГДА 0 
	|		КОГДА СУММА(ДД.КоличествоПродано) > СУММА(ДД.КоличествоФакт)
	|			ТОГДА СУММА(ДД.КоличествоПродано) / МАКСИМУМ(ПланФакт.КоличествоПлан)
	|		ИНАЧЕ СУММА(ДД.КоличествоФакт) / МАКСИМУМ(ПланФакт.КоличествоПлан)
	|	КОНЕЦ КАК КоличествоДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.ВесПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.ВесФакт) / МАКСИМУМ(ПланФакт.ВесПлан)
	|	КОНЕЦ КАК ВесДоля,
	|	ВЫБОР КОГДА МАКСИМУМ(ПланФакт.ОбъемПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.ОбъемФакт) / МАКСИМУМ(ПланФакт.ОбъемПлан)
	|	КОНЕЦ КАК ОбъемДоля,
	|	ВЫБОР КОГДА МАКСИМУМ(ПланФакт.СуммаПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СуммаФакт) / МАКСИМУМ(ПланФакт.СуммаПлан)
	|	КОНЕЦ КАК СуммаДоля,
	|	СУММА(ДД.СебестоимостьСНДС)	КАК СебестоимостьСНДС,
	|	СУММА(ДД.СебестоимостьБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СебестоимостьРегл)	КАК СебестоимостьРегл,
	|	СУММА(ДД.СебестоимостьУпр)	КАК СебестоимостьУпр,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьСНДСПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьСНДС) / МАКСИМУМ(ПланФакт.СебестоимостьСНДСПлан)
	|	КОНЕЦ КАК СебестоимостьСНДСДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьБезНДСПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьБезНДС) / МАКСИМУМ(ПланФакт.СебестоимостьБезНДСПлан)
	|	КОНЕЦ КАК СебестоимостьБезНДСДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьРеглПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьРегл) / МАКСИМУМ(ПланФакт.СебестоимостьРеглПлан)
	|	КОНЕЦ КАК СебестоимостьРеглДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьУпрПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьУпр) / МАКСИМУМ(ПланФакт.СебестоимостьУпрПлан)
	|	КОНЕЦ КАК СебестоимостьУпрДоля
	|
	|ПОМЕСТИТЬ ВтДолиПоЗаказу
	|ИЗ
	|	ВтЗаказыПланФактИсходныеДанные КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПланФактПоЗаказу КАК ПланФакт
	|		ПО ДД.ЗаказКлиента = ПланФакт.ЗаказКлиента
	|		И ДД.НаправлениеДеятельности = ПланФакт.НаправлениеДеятельности
	|ГДЕ
	|	ДД.Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ЗаказКлиента,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Склад,
	|	ДД.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Распределение по данным прошлого периода.
	|ВЫБРАТЬ
	|	1 КАК КодИсточника,
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	Доли.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ТипЗапасов КАК ТипЗапасов,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДД.Менеджер КАК Менеджер,
	|	ДД.Склад КАК Склад,
	|	ДД.Соглашение КАК Соглашение,
	|	ДД.Договор КАК Договор,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента КАК ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДД.ДокументДвижения КАК ДокументДвижения,
	|	ДД.РасчетСебестоимости КАК РасчетСебестоимости,
	|	ДД.РасчетПартий КАК РасчетПартий,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДД.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	ДД.Сторно КАК Сторно,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.КоличествоДоля
	|	КОНЕЦ) КАК КоличествоДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ВесДоля
	|	КОНЕЦ) КАК ВесДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ОбъемДоля
	|	КОНЕЦ) КАК ОбъемДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Сумма = 0 ИЛИ ДД.СуммаВВалютеВзаиморасчетов = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.СуммаВВалютеВзаиморасчетов / Доли.Сумма) * Доли.СуммаДоля
	|	КОНЕЦ) КАК СуммаДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьСНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.Стоимость
	|			+ ДД.ДопРасходы
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеСНДС
	|			+ ДД.ПостатейныеПеременныеСНДС)
	|			/ Доли.СебестоимостьСНДС) * Доли.СебестоимостьСНДСДоля КОНЕЦ) КАК СебестоимостьСНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьБезНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьБезНДС
	|			+ ДД.ДопРасходыБезНДС
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеБезНДС
	|			+ ДД.ПостатейныеПеременныеБезНДС)
	|			/ Доли.СебестоимостьБезНДС) * Доли.СебестоимостьБезНДСДоля КОНЕЦ) КАК СебестоимостьБезНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьРегл = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьРегл
	|			+ ДД.ДопРасходыРегл
	|			+ ДД.ТрудозатратыРегл
	|			+ ДД.ПостатейныеПостоянныеРегл
	|			+ ДД.ПостатейныеПеременныеРегл)
	|			/ Доли.СебестоимостьРегл) * Доли.СебестоимостьРеглДоля КОНЕЦ) КАК СебестоимостьРеглДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьУпр = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьУпр
	|			+ ДД.ДопРасходыУпр
	|			+ ДД.ТрудозатратыУпр
	|			+ ДД.ПостатейныеПостоянныеУпр
	|			+ ДД.ПостатейныеПеременныеУпр)
	|			/ Доли.СебестоимостьУпр) * Доли.СебестоимостьУпрДоля КОНЕЦ) КАК СебестоимостьУпрДоля
	|
	|ПОМЕСТИТЬ ВтБазаРаспределенияПоЗаказуКлиента
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ДД.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ДД.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДолиПоЗаказу КАК Доли
	|		ПО ДД.ЗаказКлиента = Доли.ЗаказКлиента
	|			И ДД.Регистратор = Доли.Регистратор
	|			И (Доли.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ ДД.НаправлениеДеятельностиКонтрагента = Доли.НаправлениеДеятельности)
	|			И (Доли.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ИЛИ ДД.Склад = Доли.Склад)
	|			И КлючиАналитикиУчетаНоменклатуры.Номенклатура = Доли.Номенклатура
	|			И КлючиАналитикиУчетаНоменклатуры.Характеристика = Доли.Характеристика
	|			И КлючиАналитикиУчетаНоменклатуры.Серия = Доли.Серия
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период < &НачалоПериода
	|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПродаж)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение по данным текущего периода.
	|ВЫБРАТЬ
	|	2 КАК КодИсточника,
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	Доли.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ТипЗапасов КАК ТипЗапасов,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДД.Менеджер КАК Менеджер,
	|	ДД.Склад КАК Склад,
	|	ДД.Соглашение КАК Соглашение,
	|	ДД.Договор КАК Договор,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента КАК ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДД.ДокументДвижения КАК ДокументДвижения,
	|	ДД.РасчетСебестоимости КАК РасчетСебестоимости,
	|	ДД.РасчетПартий КАК РасчетПартий,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДД.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	ДД.Сторно КАК Сторно,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.КоличествоДоля
	|	КОНЕЦ) КАК КоличествоДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ВесДоля
	|	КОНЕЦ) КАК ВесДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ОбъемДоля
	|	КОНЕЦ) КАК ОбъемДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Сумма = 0 ИЛИ ДД.СуммаВВалютеВзаиморасчетов = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.СуммаВВалютеВзаиморасчетов / Доли.Сумма) * Доли.СуммаДоля
	|	КОНЕЦ) КАК СуммаДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьСНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.Стоимость
	|			+ ДД.ДопРасходы
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеСНДС
	|			+ ДД.ПостатейныеПеременныеСНДС)
	|			/ Доли.СебестоимостьСНДС) * Доли.СебестоимостьСНДСДоля КОНЕЦ) КАК СебестоимостьСНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьБезНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьБезНДС
	|			+ ДД.ДопРасходыБезНДС
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеБезНДС
	|			+ ДД.ПостатейныеПеременныеБезНДС)
	|			/ Доли.СебестоимостьБезНДС) * Доли.СебестоимостьБезНДСДоля КОНЕЦ) КАК СебестоимостьБезНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьРегл = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьРегл
	|			+ ДД.ДопРасходыРегл
	|			+ ДД.ТрудозатратыРегл
	|			+ ДД.ПостатейныеПостоянныеРегл
	|			+ ДД.ПостатейныеПеременныеРегл)
	|			/ Доли.СебестоимостьРегл) * Доли.СебестоимостьРеглДоля КОНЕЦ) КАК СебестоимостьРеглДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьУпр = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьУпр
	|			+ ДД.ДопРасходыУпр
	|			+ ДД.ТрудозатратыУпр
	|			+ ДД.ПостатейныеПостоянныеУпр
	|			+ ДД.ПостатейныеПеременныеУпр)
	|			/ Доли.СебестоимостьУпр) * Доли.СебестоимостьУпрДоля КОНЕЦ) КАК СебестоимостьУпрДоля
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ДД.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ДД.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДолиПоЗаказу КАК Доли
	|		ПО ДД.ЗаказКлиента = Доли.ЗаказКлиента
	|			И ДД.Регистратор = Доли.Регистратор
	|			И (Доли.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ ДД.НаправлениеДеятельностиКонтрагента = Доли.НаправлениеДеятельности)
	|			И (Доли.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ИЛИ ДД.Склад = Доли.Склад)
	|			И КлючиАналитикиУчетаНоменклатуры.Номенклатура = Доли.Номенклатура
	|			И КлючиАналитикиУчетаНоменклатуры.Характеристика = Доли.Характеристика
	|			И КлючиАналитикиУчетаНоменклатуры.Серия = Доли.Серия
	|ГДЕ
	|	ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПродаж)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	НаправлениеДеятельности,
	|	Организация
	|;";

	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса);

КонецФункции
